---
kind: method
id: M:Autodesk.Revit.DB.ScheduleDefinition.IsValidFieldIndex(System.Int32)
source: html/23a9075d-dfc6-5d19-f59b-68a598bca6ca.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.IsValidFieldIndex Method

Checks whether an integer is a valid zero-based field index in this ScheduleDefinition.

## Syntax (C#)
```csharp
public bool IsValidFieldIndex(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - The field index to check.

## Returns
True if the field index is valid, false otherwise.